# 1795. Rearrange Products Table
[問題](https://leetcode.com/problems/rearrange-products-table/description/?envType=study-plan-v2&envId=30-days-of-pandas&lang=pythondata)

## 回答の方針
`melt()`してから`dropna()`する

In [57]:
import pandas as pd
import numpy as np

In [58]:
products = """
| product_id | store1 | store2 | store3 |
| 0          | 95     | 100    | 105    |
| 1          | 70     | null   | 80     |
"""

In [66]:
with open("data.txt", "w") as f:
    f.write(products)
df = pd.read_csv("data.txt", sep="|", na_values=["null"])
df.dropna(axis="columns",inplace=True)
df.columns = [x.strip() for x in df.columns]
df.replace(" null   ", np.nan, inplace=True)

In [68]:
df

   product_id  store1    store2  store3
0           0      95   100         105
1           1      70       NaN      80

In [69]:
ans = df.melt(
    id_vars="product_id",
    var_name="store",
    value_name="price"
)

In [70]:
ans

   product_id   store     price
0           0  store1        95
1           1  store1        70
2           0  store2   100
3           1  store2       NaN
4           0  store3       105
5           1  store3        80

In [71]:
ans = ans.dropna(axis=0)

In [72]:
ans

   product_id   store     price
0           0  store1        95
1           1  store1        70
2           0  store2   100
4           0  store3       105
5           1  store3        80

In [73]:
def rearrange_products_table(products: pd.DataFrame) -> pd.DataFrame:
    ans = products.melt(
        id_vars="product_id",
        var_name="store",
        value_name="price"
    )
    ans.dropna(axis=0, inplace=True)
    return ans

In [74]:
rearrange_products_table(df)

   product_id   store     price
0           0  store1        95
1           1  store1        70
2           0  store2   100
4           0  store3       105
5           1  store3        80